docs/Developer/sequenceDiagrams.md
```mermaid
sequenceDiagram
    participant Core
    participant ParamContainer
    participant Simulator
    participant ParameterManager
    participant OperationManager
    participant GraphManager
    participant Serializer
    participant Model
    participant Recorder

    Core-->>ParamContainer: Parse Command Line
    activate ParamContainer
    Note right of ParamContainer: Config File<br>Deserialize File<br>Serialize File<br>Stimulus File

    Core->>Simulator: Set File Names
    Simulator->>ParamContainer: Get File Names
    ParamContainer->>Simulator: File Names
    deactivate ParamContainer

    Core->>ParameterManager: Load Parameter File
    ParameterManager->>Simulator: Get Config File Name
    Simulator->>ParameterManager: Config File Name
    Core->>Simulator: Load Parameters
    Simulator->>ParameterManager: Get parameters from XML
    ParameterManager->>Simulator: Parameters
    Note right of Simulator: width_, height_, epochDuration_,<br>numEpochs_, maxFiringRate_,<br>maxEdgesPerVertex_, RNG, etc.

    Core->>Simulator: Instantiate Simulator Objects
    Note right of Simulator: Details are in a separate<br>sequence diagram.

    Core->>OperationManager: Register Graph Properties
    Note right of OperationManager: Ask all objects to register their Graph properties

    Core->>GraphManager: Read Graph

    Core->>OperationManager: Load Parameters
    Note right of OperationManager: Runs loadParameters method for<br>each instantiated object.<br>Methods are registered to<br>OperationManager on instantiation.

    Core->>Simulator: Setup
    Note right of Simulator: Details are in a separate<br>sequence diagram.

    opt if serialized file name available
        Core->>Serializer: Deserialize file
    end

    Core->>Simulator: Simulate
    Note right of Simulator: Details are in a separate<br>sequence diagram.

    opt if serialization file available
        Core->>Serializer: Serialize Synapses
    end

    Core->>Simulator: Finish
    Simulator->>Model: Clean up model resources
    Core->>Recorder: Terminate Recording
    Core->>Core: Exit program
```
