docs/Developer/sequenceDiagrams.md
```mermaid
sequenceDiagram
    participant Core
    participant Simulator
    participant Model
    participant Layout
    participant AllVertices
    participant Connections
    participant AllEdges
    participant Recorder

    Core->>Simulator: Setup 
    Simulator->>Model: Model Setup
    Model->>Layout: Get Vertices 
    Layout->>AllVertices: Setup Vertices
    Model->>Connections: Get Edges
    Connections->>AllEdges: Setup Edges
    Model->>Layout: Setup Layout
    Layout->>Layout: Initialize Vertices Locations
    Model->>Recorder: Initialize Recorder 
    Model->>Model: Create AllVertices*
    Model->>Layout: Generate Vertex Map 
    Model->>Layout: Initialize Starter Map 
    Model->>Layout: Create AllVertices
```
