docs/Developer/sequenceDiagrams.md
```mermaid
sequenceDiagram
    participant S as SimulationComponent
    participant R as Recorder
    participant RB as RecordableBase

    S->>R: registerVariable(varName, recordVar, variableType, ......)
    activate R
    RB->>R: getDataType(): string
    Note left of R: add all received variables to the table

    loop Simulation Epoch
        S->>RB: updateVariable()
        activate RB
        loop Variable Table Iteration
            opt if variable is DYNAMIC
                alt XmlRecorder
                    Note right of R: Capture value and Accumulate data
                    RB->>R: getElement(index): variant<uint64_t, BGFLOAT, int, bool>
                    Note left of RB: retrieve primitive data<br>that's encapsulated in a variant
                    R->>R: compileHistories()
                else HDF5Recorder
                    Note right of R: Capture data and Write data to HDF5 file
                    R->>R: compileHistories()
                end
            end
        end
    end
    loop Variable Table Iteration
        opt if variable is CONSTANT
            RB->>R: getElement(index): variant<uint64_t, BGFLOAT, int, bool>
            R->>R: captureData()
        end
        deactivate RB
        R->>R: saveSimData()
        Note right of R: Extracting the value from the variant knowing its type<br>Output data 
    end
```
